tut/11/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 2 0)
    (0 2 0)
    (0 0 4)
    (3 0 4)
    (3 2 4)
    (0 2 4)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) c0 (60 40 80) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) c0 (45 30 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        inGroup 1(wall);
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type wall;
        inGroup 1(wall);
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        inGroup 1(wall);
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
