tut/11/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    window;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.4999 1.0 -0.001)(2.5002 2.0 0.001);
        }
    }

    {
        name    heater1;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.4999 0.2 3.999)(2.5002 0.8 4.001);
        }
    }

    {
        name    heater2;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.4999 0.2 -0.001)(2.5002 0.8 0.001);
        }
    }
);

// ************************************************************************* //
